[
  {
    "role": "Software Developer",
    "company": "Exchange Solutions Inc.",
    "period": "May 2025 - Present",
    "details": [
      "Develop scalable features for a loyalty platform, contributing across frontend (React, TypeScript) and backend (AWS serverless microservices, TypeScript) in a production environment.",
      "Ensure code quality and reliability by writing and maintaining unit tests and participating in peer code reviews.",
      "Apply Agile methodologies to drive new feature development, optimize system performance, and ensure code maintainability.",
      "Work closely with senior engineers and product owners to deliver solutions impacting millions of end users."
    ]
  },
  {
    "role": "Founder & Software Developer",
    "company": "Nest",
    "period": "April 2025 - Present",
    "details": [
      "Building Nest, a modern investment insights platform designed to help long-term investors make smarter decisions with clarity and purpose.",
      "Built with a focus on simplicity, clean design, and meaningful insights.",
      "Launching Soon"
    ]
  },
  {
    "role": "Teaching Assistant",
    "company": "George Brown College",
    "period": "January 2024 - April 2025",
    "details": [
      "Assisted in teaching COMP1234 (Introduction to Web Development), COMP1235 (Introduction to Full Stack Development), and COMP2080 (Data Structures and Algorithms).",
      "Provided lab support and guidance to students, helping them troubleshoot issues and understand core concepts.",
      "Collaborated with professors to deliver effective course content and ensure student success."
    ]
  },
  {
    "role": "Software Developer Intern",
    "company": "Exchange Solutions Inc.",
    "period": "May 2024 - August 2024",
    "details": [
      "Contributed to both frontend (React, TypeScript) and backend (AWS serverless microservices, TypeScript) development on a production-grade loyalty platform.",
      "Developed practical skills in cloud infrastructure (AWS), CI/CD (Jenkins), and Atlassian tools in a collaborative, fast-paced environment."
    ]
  },
  {
    "role": "Software Developer Intern (Innovation Labs)",
    "company": "Exchange Solutions Inc.",
    "period": "May 2023 - September 2023",
    "details": [
      "Developed proof-of-concept Retrieval Augmented Generation (RAG) AI agents using Node.js and OpenAI APIs in direct collaboration with the Director of Innovation Labs.",
      "Conducted research and rapid prototyping that contributed to the adoption of generative AI capabilities in the company's core loyalty product."
    ]
  },
  {
    "role": "Front-End Developer Intern",
    "company": "PresenTEC Solutions",
    "period": "December 2022 - April 2023",
    "details": [
      "Maintained and improved company website functionality using WordPress and custom development.",
      "Implemented UI improvements following company brand guidelines to ensure a consistent user experience."
    ]
  }
]
